"""
3. Реализовать программу работы с органическими клетками. Необходимо создать класс Клетка.
В его конструкторе инициализировать параметр, соответствующий количеству клеток (целое число).
В классе должны быть реализованы методы перегрузки арифметических операторов: сложение (__add__()),
вычитание (__sub__()), умножение (__mul__()), деление (__truediv__()).
Данные методы должны применяться только к клеткам и выполнять увеличение, уменьшение,
умножение и обычное (не целочисленное) деление клеток, соответственно.
В методе деления должно осуществляться округление значения до целого числа.
Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.
Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность
количества ячеек двух клеток больше нуля, иначе выводить соответствующее сообщение.
Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как
произведение количества ячеек этих двух клеток.
Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как целочисленное
деление количества ячеек этих двух клеток.
В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду.
Данный метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно
переданному аргументу. Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда
метод make_order() вернет строку: *****\n*****\n**.
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда метод make_order()
вернет строку: *****\n*****\n*****.
Подсказка: подробный список операторов для перегрузки доступен по ссылке.
"""


class Cell:
    def __init__(self, count):
        self.count = count

    def make_order(self, cells):
        cells_result = ""
        for step in range(self.count // cells):
            cells_result += "*" * cells + "\n"
        cells_result += "*" * (self.count % cells) + "\n"
        return cells_result

    def __add__(self, other):
        return "Результат сложения клеток: " + str(self.count + other.count)

    def __sub__(self, other):
        if self.count - other.count > 0:
            return "Результат вычитания клеток: " + self.count - other.count
        else:
            return "Вычитание невозможно."

    def __mul__(self, other):
        return "Результат умножения клеток: " + str(self.count * other.count)

    def __truediv__(self, other):
        return "Результат деления клеток: " + str(round(self.count / other.count))

    def __str__(self):
        return self.count


cell_1 = Cell(10)
cell_2 = Cell(7)
print(cell_1.make_order(4))
print(cell_1 + cell_2)
