"""
6. Реализовать функцию int_func(),
принимающую слово из маленьких латинских букв и возвращающую его же,
но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
Продолжить работу над заданием. В программу должна попадать строка из слов,
разделенных пробелом. Каждое слово состоит из латинских букв в нижнем регистре.
Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
Необходимо использовать написанную ранее функцию int_func().
"""


def int_func(user_list):

    for step in range(0, len(user_list)):
        user_list[step] = user_list[step].capitalize()
    my_result = " ".join(user_list)
    return my_result


print(int_func(input("Введите строку из слов латинскими буквами в нижнем регистре, разделенных пробелом: ").split()))
