"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
"""

month = int(input("Введите пожалуйста месяц (от 1 до 12): "))
season_list = ["зима", "весна", "лето", "осень"]
if (month >= 9) and (month <= 11):
    season = 3
elif (month >= 3) and (month <= 5):
    season = 1
elif (month >= 6) and (month <= 8):
    season = 2
else:
    season = 0
print(f"{season_list[season]} - замечательное время года!!")

season_dict = {
    1: "зима",
    2: "зима",
    3: "весна",
    4: "весна",
    5: "весна",
    6: "лето",
    7: "лето",
    8: "лето",
    9: "осень",
    10: "осень",
    11: "осень",
    12: "зима"
}
print(f"{season_dict[month]} - замечательная пора!!!")
